# SpaceCoolingSetPoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceCoolingSetPoint Property
ParameterTypeId Class See Also
---
"Cooling Set Point"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceCoolingSetPoint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceCoolingSetPoint As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceCoolingSetPoint {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace